siak1m/nrf51dk-squarewave/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief ADC interrupt handler.
 * Prints ADC results on hardware UART and over BLE via the NUS service.
 */
static void adc_event_handler_original(nrf_drv_adc_evt_t const * p_event)
{
    uint8_t adc_result[ADC_BUFFER_SIZE*2];
	
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        adc_event_counter++;
        printf("    ADC event counter: %d\r\n", adc_event_counter);			
        uint32_t i;
        for (i = 0; i < p_event->data.done.size; i++)
        {
            printf("Sample value %d: %d\r\n", (unsigned int)i+1, p_event->data.done.p_buffer[i]);   //Print ADC result on hardware UART
            adc_result[(i*2)] = p_event->data.done.p_buffer[i] >> 8;
            adc_result[(i*2)+1] = p_event->data.done.p_buffer[i];					
        }
        if(ADC_BUFFER_SIZE <= 10)
        {
            ble_nus_string_send(&m_nus, &adc_result[0], ADC_BUFFER_SIZE*2);           //Send ADC result over BLE via NUS service
        }		
        LEDS_INVERT(BSP_LED_3_MASK);				                                          //Indicate sampling complete on LED 4
    }
}

static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
{
    uint8_t adc_result[ADC_BUFFER_SIZE*2];
	
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        adc_event_counter++;
        printf("    ADC event counter: %d\r\n", adc_event_counter);			
        uint32_t i;
        for (i = 0; i < p_event->data.done.size; i++)
        {
            printf("Sample value %d: %d\r\n", (i%number_of_adc_channels), p_event->data.done.p_buffer[i]);   //Print ADC result on hardware UART
            adc_result[(i*2)] = p_event->data.done.p_buffer[i] >> 8;
            adc_result[(i*2)+1] = p_event->data.done.p_buffer[i];					
        }
        if(ADC_BUFFER_SIZE <= 10)
        {
					ble_nus_string_send(&m_nus, &adc_result[0], ADC_BUFFER_SIZE*2);           //Send ADC result over BLE via NUS service
				}		
        LEDS_INVERT(BSP_LED_3_MASK);				                                          //Indicate sampling complete on LED 4
    }
}

/**
 * @brief ADC initialization.
 */
static void adc_config_original(void)
{
    ret_code_t ret_code;
    nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;

    ret_code = nrf_drv_adc_init(&config, adc_event_handler);
    APP_ERROR_CHECK(ret_code);

    nrf_drv_adc_channel_enable(&m_channel_config);
}

static void adc_config(void)
{
	ret_code_t ret_code;
	
	//Initialize ADC
	nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;
	ret_code = nrf_drv_adc_init(&config, adc_event_handler);
	APP_ERROR_CHECK(ret_code);
	
	//Configure and enable ADC channel 0
	static nrf_drv_adc_channel_t m_channel_0_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_2);
	m_channel_0_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
	nrf_drv_adc_channel_enable(&m_channel_0_config);
	
	//Configure and enable ADC channel 1
	static nrf_drv_adc_channel_t m_channel_1_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_3);
	m_channel_1_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
	nrf_drv_adc_channel_enable(&m_channel_1_config);
	
	//Configure and enable ADC channe 2
	static nrf_drv_adc_channel_t m_channel_2_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_4);
	m_channel_2_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
	nrf_drv_adc_channel_enable(&m_channel_2_config);
	
	number_of_adc_channels = 3; //Set equal to the number of configured ADC channels, for the sake of UART output
	
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    
    adc_config();

    // Enter main loop.
    for (;;)
    {
        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));   //Allocate buffer for ADC
        for (uint32_t i = 0; i < ADC_BUFFER_SIZE; i++)
        {
            nrf_drv_adc_sample();           // manually trigger ADC conversion
            power_manage();                 // CPU enter sleep mode during sampling. CPU will be enabled again when ADC interrupt occurs and adc_event_handler is called
            LEDS_INVERT(BSP_LED_1_MASK);    // Indicate sampling complete
            nrf_delay_ms(250);              // Slow down sampling frequency with 250ms blocking delay
        }
    }
}


/**
 * @}
 */
